{"pageProps":{"topic":"upload","item":"inaturalist","content":{"title":"iNaturalist","sections":[{"title":"Import and Export Observations","steps":[{"text":"iNaturalist is one of the world’s most popular nature apps and is great for identifying plants and animals.\n\nhttps://www.inaturalist.org/pages/about\n\nUpon sync, your NatureShare records will be submitted to iNaturalist as observations. Photos are uploaded (but not video nor audio) and only the primary (first) identification of each record can be transferred.\n\nObservations under your iNaturalist account will be imported to your NatureShare dataset as plain-text YAML files and indexed as standards-compliant JSONFeed, GeoJSON, Atom and RSS files. Note, photos are not downloaded - a link is created to the original file stored on the iNaturalist servers.\n\nTo avoid flooding the iNaturalist API, uploads are currently limited to 100 observations per sync.\n\nOnly photo thumbnail sizes (not the originals) are uploaded to reduce the load on iNaturalist servers. A link (href) is created back to your original item page on NatureShare.org.\n\nSource code is available for review here:\nhttps://github.com/natureshare/natureshare-scripts/blob/master/actions/importers/inaturalist.js\n"}]},{"title":"Connect Your Account","steps":[{"title":"Go To Upload Page","image":"./inaturalist/connect.png","text":"Go to the NatureShare *Upload* page (also found the in side menu):\n\nhttps://natureshare.org/upload\n\nClick the CONNECT button in the iNaturalist box and you will be redirected to the **official** iNaturalist website.\n"},{"title":"iNaturalist Authorisation","image":"./inaturalist/auth.png","text":"Click the green *Authorize* button.\n"},{"title":"Return","text":"You should then return to the *Upload* page.\n"}]},{"title":"Sync","steps":[{"image":"./inaturalist/sync.png","text":"To import and export observations, click on the *SYNC NOW* button.\n"},{"title":"Please Wait","text":"Sync can be a slow process and your computer may also cache this website for up to one day.\n\nPlease return later to see your observations appear on NatureShare.\n"}]}]}},"__N_SSG":true}